# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

install vim --override-system-vi

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
# brew 'ffmpeg'
brew 'git'
# brew 'gnupg2'
brew 'grep'
brew 'httpie'
# brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
# brew 'pkg-config'
# brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
# brew 'php'
# brew 'php@7.3'
# brew 'php@7.2'
brew 'composer'
# brew 'imagemagick'
# brew 'mysql'
# brew 'nginx'
# brew 'redis'
brew 'npm'
brew 'yarn'

# k8s
brew 'k9s'
brew 'helm'

# IDE
cask 'phpstorm'
cask 'goland'
cask 'pycharm'
cask 'android-studio'
cask 'sublime-text'
cask 'visual-studio-code'

# DB
cask 'mysqlworkbench'
cask 'sequel-pro'

# Browsers
cask 'brave-browser'
# cask 'tor-browser'
cask 'google-chrome'
cask 'firefox'

# cask 'adobe-photoshop-cc'

# Apps
# cask '1password'
cask 'aerial'
# cask 'alfred'
cask 'bartender'
cask 'caffeine'
# cask 'discord'
cask 'docker'
# cask 'github'
cask 'google-backup-and-sync'
# cask 'gpg-suite'
cask 'imageoptim'
cask 'java'
# cask 'screenflow'
cask 'sip'
cask 'tableplus'
# cask 'there'
cask 'the-unarchiver'
cask 'transmission'
# cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox' # Might need to allow access in Security settings
# cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'teamviewer'
cask 'insomnia'
cask 'postman'
cask 'proxyman'
# cask 'handbrake' # Video Converter App

# Messengers
cask 'telegram-desktop'
# cask 'whatsapp'
cask 'skype'
cask 'slack'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
